In [3]:
import pandas as pd

dictionary={"a":"1","b":"2","c":"3"}
series=pd.Series(dictionary)
print(series)

a    1
b    2
c    3
dtype: object

In [8]:
import pandas as pd

value=(1,2,3)
index=("a","b","c")

series=pd.Series(value,index)
print(series)

a    1
b    2
c    3
dtype: int64

In [10]:
#Dataframe  
#craeting a dataframe from dictionary

data={
      "name":["sujal","devang","aadi"],
      "age":[20,21,22],
      "city":["pune","ankleshwar","jaipur"]
}

dataf=pd.DataFrame(data)
print(dataf)
print(type(dataf))

     name  age        city
0   sujal   20        pune
1  devang   21  ankleshwar
2    aadi   22      jaipur
<class 'pandas.core.frame.DataFrame'>

In [16]:

import pandas as pd
df=pd.read_csv("sales_data.csv")
df.head(6)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
5,10006,2024-01-06,Sports,Wilson Evolution Basketball,5,29.99,149.95,Asia,Credit Card

In [6]:
import pandas as pd
data={
      "name":["sujal","devang","aadi"],
      "age":[20,21,22],
      "city":["pune","ankleshwar","jaipur"]
}

dataf=pd.DataFrame(data)
print(dataf)
print(type(dataf))
dataf

     name  age        city
0   sujal   20        pune
1  devang   21  ankleshwar
2    aadi   22      jaipur
<class 'pandas.core.frame.DataFrame'>

     name  age        city
0   sujal   20        pune
1  devang   21  ankleshwar
2    aadi   22      jaipur

In [7]:
dataf

     name  age        city
0   sujal   20        pune
1  devang   21  ankleshwar
2    aadi   22      jaipur

In [17]:
#accessing dataframe items

dataf["name"]

dataf.loc[0]    #gives 0 row value

dataf.iloc[1]   #gives 1 coloumn value
dataf.iloc[0][1]

dataf.at[2,"city"]

C:\Users\sujal\AppData\Local\Temp\ipykernel_8244\3603542780.py:8: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  dataf.iloc[0][1]

'jaipur'

In [27]:
#adding and removing from dataframe

dataf
#adding
dataf["salary"]=30000,40000,50000
dataf

#removing
dataf.drop("salary",axis=1)           #it will remove the salary coloumn but not permanent if we call dataf again salary coloumn will come 
                                            #so to permanent delete it we use "inplace="" 
dataf

dataf.drop("salary",axis=1,inplace=True)
dataf

     name  age        city
0   sujal   20        pune
1  devang   21  ankleshwar
2    aadi   22      jaipur

In [30]:
#increasing value in dataframe

dataf["age"]=dataf["age"]+1
dataf

     name  age        city
0   sujal   23        pune
1  devang   24  ankleshwar
2    aadi   25      jaipur